org-roam.bak/20200605013212-circuiti_combinatori.org
#+TITLE: Circuiti Combinatori
#+ROAM-TAG: "Elettronica"

* Decoder
:PROPERTIES:
:ID:       1f02de71-8ead-4d9f-a29b-921e63da2b46
:END:

Funzione di ~indirizzamento~
- INPUT

  n

- OUTPUT

  2^n


* Multiplexer
:PROPERTIES:
:ID:       19354b03-dfca-454b-a2af-90ffdfcbd59c
:END:

Puo' implementare una qualsiasi ~funzione n-aria~, esiste anche un ~Demultiplexer~

- INPUT

  2^n

- Controllo

  n

- OUTPUT

  1


* Comparatori
:PROPERTIES:
:ID:       e4985c14-a820-4323-bf4c-ba78c4ca38e2
:END:

- INPUT

  due serie da n bit l'una

- OUTPUT

  1 se uguali
  0 se diversi

- Implementazione

  NOR(In1 XOR In2)


* Shifter
:PROPERTIES:
:ID:       f8b5a455-2e18-4f39-8569-46c4eade722c
:END:

Implementa la moltiplicazione binaria

- INPUT

  n bit

- OUTPUT

  n bit << o >> di 1 bit

- Controllo

  Determina la direzione dello shift

* Adder
:PROPERTIES:
:ID:       c0ec0aba-1c58-4590-9768-16097f5bc955
:END:

Implementa la somma
half-adder e riporto/carry --> full-adder

* [[file:20200530050045-alu.org][ALU]]
:PROPERTIES:
:ID:       49cb7400-d989-42be-bcc0-a731e0684360
:END:

* 1 Linked References
** [[file:20200929150429-c.org][C ➦]]
1. Digital Logic
